// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给可爱的",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "蒋坚强小寿星",  // 同上...
        "今天是你的生日",
        "虽然我们认识的时间不算长",
        "可能对你来说",
        "我仍是陌生的",
        "不过",
        "我感觉很开心",
        "也很幸运",
        "能够遇见你",
        "这是我们相识后",
        "你的第一个生日",
        "由于时间的仓促",
        "和距离的相隔",
        "很抱歉",
        "没能够为你送什么礼物",
        "不过！",
        "我偷偷记下了~",
        "这次的先欠着啦",
        "以后给你补上~",
        "哈哈哈哈哈哈",
        "想了想",
        "这几天给你做了这个小网页",
        "可能略显有点low吧",
        "比不上你朋友送的那些礼物",
        "但！",
        "这也是我自己做了好久",
        "同样诚心满满的",
        "（允许自夸一波~）",
        "哈哈哈哈哈哈",
        "不过",
        "还是希望",
        "不要被嫌弃哈",
        "同时也希望",
        "在以后每一个有意义的时刻",
        "都能够祝福于你",
        "哦~对了！",
        "差点忘了正事",
        "祝小寿星生日快乐呀！",
        "不仅仅是今天快乐 ",
        "而是到下一个生日之前的",
        "一整年都要快乐！",
        "然后再继续下一年的快乐",
        "哈哈哈哈哈哈",
        "你的烦人精~~~",
        "只烦蒋坚强的烦人精",
        "哈哈哈哈哈哈~~~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "心爱的小可爱": "./imgs/xiaokeai.png",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
